                                                      /* Create by #FF69B4 */
class Miscellaneous
{
	int                                                cl_entitylist;                                            // 0x1B0E678(0x00x4)
	int                                                LocalPlayer;                                              // 0x1EBF488(0x00x4)
	int                                                NameList;                                                 // 0xBC1C040(0x00x4)
	int                                                ViewRender;                                               // 0x7641830(0x00x4)
	int                                                StudioHdr;                                                // 0x10F0(0x00x4)
};

//class DataMap.C_BaseAnimating
class C_BaseAnimating
{
	float                                              m_currentFrame.animCycle;                                 // 0x00C4(0x0004)
	int                                                m_animNetworkFlags;                                       // 0x0A88(0x0004)
	bool                                               m_networkAnimActive;                                      // 0x0A8C(0x0001)
	bool                                               m_animActive;                                             // 0x0A8E(0x0001)
	bool                                               m_animCollisionEnabled;                                   // 0x0A8F(0x0001)
	bool                                               m_animRelativeToGroundEnabled;                            // 0x0A90(0x0001)
	bool                                               m_animPlantingEnabled;                                    // 0x0A91(0x0001)
	struct Embedded                                    m_predictedAnimEventData;                                 // 0x0B88(0x0000)
	struct Embedded                                    m_SequenceTransitioner;                                   // 0x0C20(0x0000)
	int                                                m_nSkin;                                                  // 0x0E50(0x0004)
	short                                              m_skinMod;                                                // 0x0E54(0x0002)
	int                                                m_nBody;                                                  // 0x0E58(0x0004)
	int                                                m_camoIndex;                                              // 0x0E5C(0x0004)
	struct Time                                        m_nResetEventsStartTime;                                  // 0x0E64(0x0004)
	int                                                m_nResetEventsParity;                                     // 0x0E68(0x0004)
	bool                                               m_bSequenceFinished;                                      // 0x0EFC(0x0001)
	bool                                               m_bSequenceLooped;                                        // 0x0F04(0x0001)
	bool                                               m_bSequenceLoops;                                         // 0x0F05(0x0001)
	bool                                               m_bSequenceReadyForBreakout;                              // 0x0F06(0x0001)
	float                                              m_flModelScale;                                           // 0x0F08(0x0004)
	float                                              m_currentFrameBaseAnimating.animStartTime;                // 0x0F14(0x0004)
	float                                              m_currentFrameBaseAnimating.animStartCycle;               // 0x0F18(0x0004)
	float                                              m_currentFrameBaseAnimating.animPlaybackRate;             // 0x0F1C(0x0004)
	int                                                m_currentFrameBaseAnimating.animModelIndex;               // 0x0F20(0x0004)
	int                                                m_currentFrameBaseAnimating.animSequenceParity;           // 0x0F24(0x0004)
	int                                                m_currentFrameBaseAnimating.animSequence;                 // 0x0F2C(0x0002)
	float                                              m_currentFrameBaseAnimating.m_flPoseParameters;           // 0x0F3C(0x0060)
};

//class DataMap.C_ClientRagdoll
class C_ClientRagdoll
{
	struct Color32                                     m_clrRender;                                              // 0x0050(0x0004)
	char                                               m_nRenderFX;                                              // 0x04AD(0x0001)
	char                                               m_nRenderMode;                                            // 0x04B9(0x0001)
	struct Embedded                                    m_pRagdoll;                                               // 0x0BE8(0x0008)
	int                                                m_nSkin;                                                  // 0x0E50(0x0004)
	short                                              m_skinMod;                                                // 0x0E54(0x0002)
	int                                                m_nBody;                                                  // 0x0E58(0x0004)
	bool                                               m_bFadeOut;                                               // 0x1640(0x0001)
	bool                                               m_bImportant;                                             // 0x1641(0x0001)
	struct Time                                        m_flEffectTime;                                           // 0x1644(0x0004)
	int                                                m_iCurrentFriction;                                       // 0x1648(0x0004)
	int                                                m_iMinFriction;                                           // 0x164C(0x0004)
	int                                                m_iMaxFriction;                                           // 0x1650(0x0004)
	float                                              m_flFrictionModTime;                                      // 0x1654(0x0004)
	struct Time                                        m_flFrictionTime;                                         // 0x1658(0x0004)
	int                                                m_iFrictionAnimState;                                     // 0x165C(0x0004)
	bool                                               m_bReleaseRagdoll;                                        // 0x1660(0x0001)
	bool                                               m_bFadingOut;                                             // 0x1661(0x0001)
	float                                              m_flScaleEnd;                                             // 0x1664(0x0028)
	float                                              m_flScaleTimeStart;                                       // 0x168C(0x0028)
	float                                              m_flScaleTimeEnd;                                         // 0x16B4(0x0028)
};

//class DataMap.C_Player
class C_Player
{
	int                                                m_fFlags;                                                 // 0x0098(0x0004)
	float                                              m_currentFrame.animCycle;                                 // 0x00C4(0x0004)
	struct EHANDLE                                     m_pMoveParent;                                            // 0x0118(0x0004)
	struct Vector                                      m_vecAbsVelocity;                                         // 0x0140(0x000C)
	struct EHANDLE                                     m_hGroundEntity;                                          // 0x0438(0x0004)
	int                                                m_flMaxspeed;                                             // 0x0440(0x0004)
	struct Time                                        m_jumpPadDebounceExpireTime;                              // 0x0464(0x0004)
	struct Vector                                      m_vecVelocity;                                            // 0x0488(0x000C)
	float                                              m_flFriction;                                             // 0x04A0(0x0004)
	int                                                m_nNextThinkTick;                                         // 0x0574(0x0004)
	struct Embedded                                    m_SequenceTransitioner;                                   // 0x0C20(0x0000)
	float                                              m_currentFrameBaseAnimating.animStartTime;                // 0x0F14(0x0004)
	float                                              m_currentFrameBaseAnimating.animStartCycle;               // 0x0F18(0x0004)
	float                                              m_currentFrameBaseAnimating.animPlaybackRate;             // 0x0F1C(0x0004)
	int                                                m_currentFrameBaseAnimating.animSequenceParity;           // 0x0F24(0x0004)
	int                                                m_currentFrameBaseAnimating.animSequence;                 // 0x0F2C(0x0002)
	float                                              m_currentFrameBaseAnimating.m_flPoseParameters;           // 0x0F3C(0x0060)
	bool                                               m_bZooming;                                               // 0x1C31(0x0001)
	struct Time                                        m_zoomToggleOnStartTime;                                  // 0x1C34(0x0004)
	float                                              m_zoomBaseFrac;                                           // 0x1C38(0x0004)
	struct Time                                        m_zoomBaseTime;                                           // 0x1C3C(0x0004)
	struct Time                                        m_zoomFullStartTime;                                      // 0x1C40(0x0004)
	int                                                m_lastUCmdSimulationTicks;                                // 0x1CB4(0x0004)
	float                                              m_lastUCmdSimulationRemainderTime;                        // 0x1CB8(0x0004)
	struct Embedded                                    m_Local;                                                  // 0x1DF0(0x0000)
	float                                              m_currentFramePlayer.timeBase;                            // 0x20D8(0x0004)
	struct Embedded                                    m_currentFramePlayer.statusEffectsTimedPlayerCUR;         // 0x20E0(0x0000)
	struct Embedded                                    m_currentFramePlayer.statusEffectsEndlessPlayerCUR;       // 0x21D0(0x0000)
	float                                              m_currentFramePlayer.m_flHullHeight;                      // 0x2270(0x0004)
	float                                              m_currentFramePlayer.m_traversalAnimProgress;             // 0x2274(0x0004)
	float                                              m_currentFramePlayer.m_sprintTiltFrac;                    // 0x2278(0x0004)
	float                                              m_currentFramePlayer.m_ziprailBankTiltFrac;               // 0x227C(0x0004)
	int                                                m_currentFramePlayer.m_ammoPoolCount;                     // 0x228C(0x0020)
	struct Vector                                      m_currentFrameLocalPlayer.m_stepSmoothingOffset;          // 0x2460(0x000C)
	int                                                m_currentFrameLocalPlayer.m_duckTransitionRemainderMsec;  // 0x246C(0x0004)
	struct Vector                                      m_currentFrameLocalPlayer.m_vecPunchBase_Angle;           // 0x2470(0x000C)
	struct Vector                                      m_currentFrameLocalPlayer.m_vecPunchBase_AngleVel;        // 0x247C(0x000C)
	struct Vector                                      m_currentFrameLocalPlayer.m_vecPunchWeapon_Angle;         // 0x2488(0x000C)
	float                                              m_currentFrameLocalPlayer.m_vecPunchWeapon_AngleVel.x;    // 0x2494(0x0004)
	float                                              m_currentFrameLocalPlayer.m_vecPunchWeapon_AngleVel.y;    // 0x2498(0x0004)
	float                                              m_currentFrameLocalPlayer.m_vecPunchWeapon_AngleVel.z;    // 0x249C(0x0004)
	struct Quaternion                                  m_currentFrameLocalPlayer.m_localGravityRotation;         // 0x24D8(0x0010)
	struct Embedded                                    pl;                                                       // 0x2500(0x0000)
	int                                                m_ammoPoolCapacity;                                       // 0x2584(0x0004)
	struct unknow                                      m_classModsActive;                                        // 0x25C0(0x0008)
	short                                              m_gestureSequences;                                       // 0x28CC(0x0010)
	struct Time                                        m_gestureStartTimes;                                      // 0x28DC(0x0020)
	float                                              m_gestureBlendInDuration;                                 // 0x28FC(0x0020)
	float                                              m_gestureBlendOutDuration;                                // 0x291C(0x0020)
	struct Time                                        m_gestureFadeOutStartTime;                                // 0x293C(0x0020)
	float                                              m_gestureFadeOutDuration;                                 // 0x295C(0x0020)
	int                                                m_gestureAutoKillBitfield;                                // 0x297C(0x0004)
	int                                                m_afButtonLast;                                           // 0x2998(0x0004)
	int                                                m_afButtonPressed;                                        // 0x299C(0x0004)
	int                                                m_afButtonReleased;                                       // 0x29A0(0x0004)
	int                                                m_nButtons;                                               // 0x29A4(0x0004)
	int                                                m_nImpulse;                                               // 0x29A8(0x0004)
	int                                                m_flPhysics;                                              // 0x29AC(0x0004)
	float                                              m_flStepSoundTime;                                        // 0x29B0(0x0004)
	float                                              m_flTimeAllSuitDevicesOff;                                // 0x29B4(0x0004)
	float                                              m_fStickySprintMinTime;                                   // 0x29B8(0x0004)
	bool                                               m_bPlayedSprintStartEffects;                              // 0x29BC(0x0001)
	bool                                               m_fIsSprinting;                                           // 0x29C4(0x0001)
	bool                                               m_fIsWalking;                                             // 0x29C5(0x0001)
	struct Time                                        m_lastSprintPressTime;                                    // 0x29D4(0x0004)
	struct Time                                        m_stickySprintForwardEnableTime;                          // 0x29D8(0x0004)
	struct Time                                        m_stickySprintForwardDisableTime;                         // 0x29DC(0x0004)
	struct Time                                        m_sprintStartedTime;                                      // 0x29E0(0x0004)
	float                                              m_sprintStartedFrac;                                      // 0x29E4(0x0004)
	struct Time                                        m_sprintEndedTime;                                        // 0x29E8(0x0004)
	float                                              m_sprintEndedFrac;                                        // 0x29EC(0x0004)
	struct Time                                        m_stickySprintStartTime;                                  // 0x29F0(0x0004)
	struct Time                                        m_damageImpulseNoDecelEndTime;                            // 0x29F4(0x0004)
	int                                                m_duckState;                                              // 0x2A14(0x0004)
	int                                                m_leanState;                                              // 0x2A18(0x0004)
	bool                                               m_doingHalfDuck;                                          // 0x2A1C(0x0001)
	bool                                               m_canStand;                                               // 0x2A1D(0x0001)
	struct Vector                                      m_StandHullMin;                                           // 0x2A20(0x000C)
	struct Vector                                      m_StandHullMax;                                           // 0x2A2C(0x000C)
	struct Vector                                      m_DuckHullMin;                                            // 0x2A38(0x000C)
	struct Vector                                      m_DuckHullMax;                                            // 0x2A44(0x000C)
	struct Vector                                      m_upDir;                                                  // 0x2A54(0x000C)
	struct Vector                                      m_upDirPredicted;                                         // 0x2A60(0x000C)
	struct Vector                                      m_lastWallRunStartPos;                                    // 0x2A6C(0x000C)
	int                                                m_wallRunCount;                                           // 0x2A78(0x0004)
	bool                                               m_wallRunWeak;                                            // 0x2A7C(0x0001)
	bool                                               m_shouldBeOneHanded;                                      // 0x2A7D(0x0001)
	float                                              m_oneHandFraction;                                        // 0x2A80(0x0004)
	float                                              m_animAimPitch;                                           // 0x2A84(0x0004)
	float                                              m_animAimYaw;                                             // 0x2A88(0x0004)
	float                                              m_wallRunPushAwayTime;                                    // 0x2A98(0x0004)
	struct Time                                        m_wallrunRetryTime;                                       // 0x2AA4(0x0004)
	struct Vector                                      m_wallrunRetryPos;                                        // 0x2AA8(0x000C)
	struct Vector                                      m_wallrunRetryNormal;                                     // 0x2AB4(0x000C)
	float                                              m_wallHangTime;                                           // 0x2AD8(0x0004)
	int                                                m_traversalState;                                         // 0x2ADC(0x0004)
	int                                                m_traversalType;                                          // 0x2AE0(0x0004)
	struct Vector                                      m_traversalBegin;                                         // 0x2AE4(0x000C)
	struct Vector                                      m_traversalMid;                                           // 0x2AF0(0x000C)
	struct Vector                                      m_traversalEnd;                                           // 0x2AFC(0x000C)
	float                                              m_traversalMidFrac;                                       // 0x2B08(0x0004)
	struct Vector                                      m_traversalForwardDir;                                    // 0x2B0C(0x000C)
	struct Vector                                      m_traversalRefPos;                                        // 0x2B18(0x000C)
	float                                              m_traversalProgress;                                      // 0x2B24(0x0004)
	struct Time                                        m_traversalStartTime;                                     // 0x2B28(0x0004)
	struct Time                                        m_traversalHandAppearTime;                                // 0x2B2C(0x0004)
	struct Time                                        m_traversalReleaseTime;                                   // 0x2B30(0x0004)
	struct Time                                        m_traversalBlendOutStartTime;                             // 0x2B34(0x0004)
	struct Vector                                      m_traversalBlendOutStartOffset;                           // 0x2B38(0x000C)
	float                                              m_traversalYawDelta;                                      // 0x2B44(0x0004)
	struct Time                                        m_wallDangleJumpOffTime;                                  // 0x2B50(0x0004)
	bool                                               m_wallDangleMayHangHere;                                  // 0x2B54(0x0001)
	bool                                               m_wallDangleForceFallOff;                                 // 0x2B55(0x0001)
	bool                                               m_wallDangleLastPushedForward;                            // 0x2B56(0x0001)
	int                                                m_wallDangleDisableWeapon;                                // 0x2B58(0x0004)
	float                                              m_wallDangleClimbProgressFloor;                           // 0x2B5C(0x0004)
	bool                                               m_wallClimbSetUp;                                         // 0x2B60(0x0001)
	bool                                               m_wallHanging;                                            // 0x2B61(0x0001)
	bool                                               m_gravityLiftActive;                                      // 0x2B62(0x0001)
	struct Time                                        m_gravityLiftEnterTime;                                   // 0x2B64(0x0004)
	struct Time                                        m_gravityLiftEjectTime;                                   // 0x2B68(0x0004)
	float                                              m_gravityLiftHoverTime;                                   // 0x2B6C(0x0004)
	struct Vector                                      m_gravityLiftLastOrigin;                                  // 0x2B70(0x000C)
	struct Vector                                      m_gravityLiftEjectVelocity;                               // 0x2B7C(0x000C)
	bool                                               m_blackholeActive;                                        // 0x2B88(0x0001)
	bool                                               m_jetDriveWasActive;                                      // 0x2B89(0x0001)
	bool                                               m_jetDriveActive;                                         // 0x2B8A(0x0001)
	struct Vector                                      m_jetDriveTargetPos;                                      // 0x2B8C(0x000C)
	struct EHANDLE                                     m_jetDriveTargetEnt;                                      // 0x2B98(0x0004)
	struct Vector                                      m_jetDriveTargetEntOffset;                                // 0x2B9C(0x000C)
	struct Vector                                      m_jetDriveStartPos;                                       // 0x2BA8(0x000C)
	struct Time                                        m_jetDriveStartTime;                                      // 0x2BB4(0x0004)
	float                                              m_jetDriveSpeed;                                          // 0x2BB8(0x0004)
	float                                              m_jetDriveAccel;                                          // 0x2BBC(0x0004)
	struct Time                                        m_jetDriveDecelWindowTimeOutTime;                         // 0x2BC0(0x0004)
	bool                                               m_jetDriveInDecelWindow;                                  // 0x2BC4(0x0001)
	float                                              m_jetDriveTimeout;                                        // 0x2BC8(0x0004)
	struct Vector                                      m_jetDriveDoubleJumpVelocity;                             // 0x2BCC(0x000C)
	struct Embedded                                    m_grapple;                                                // 0x2C60(0x0000)
	struct Embedded                                    m_grapple;                                                // 0x2C60(0x0000)
	bool                                               m_grappleActive;                                          // 0x2CF0(0x0001)
	bool                                               m_grappleActive;                                          // 0x2CF0(0x0001)
	bool                                               m_grappleNeedWindowCheck;                                 // 0x2CF1(0x0001)
	struct EHANDLE                                     m_grappleNextWindowHint;                                  // 0x2CF4(0x0004)
	bool                                               m_slowMoEnabled;                                          // 0x2D04(0x0001)
	bool                                               m_sliding;                                                // 0x2D05(0x0001)
	bool                                               m_slideLongJumpAllowed;                                   // 0x2D06(0x0001)
	struct Time                                        m_lastSlideTime;                                          // 0x2D08(0x0004)
	float                                              m_lastSlideBoost;                                         // 0x2D0C(0x0004)
	int                                                m_gravityGrenadeStatusEffect;                             // 0x2D10(0x0004)
	float                                              m_ziprailBankTiltVel;                                     // 0x2D14(0x0004)
	bool                                               m_bIsStickySprinting;                                     // 0x2D1A(0x0001)
	float                                              m_prevMoveYaw;                                            // 0x2D1C(0x0004)
	float                                              m_sprintTiltVel;                                          // 0x2D20(0x0004)
	struct EHANDLE                                     m_turret;                                                 // 0x2D34(0x0004)
	struct EHANDLE                                     m_hViewModels;                                            // 0x2D38(0x000C)
	struct Embedded                                    m_viewOffsetEntity;                                       // 0x2D48(0x0000)
	struct EHANDLE                                     m_activeZipline;                                          // 0x2E78(0x0004)
	struct EHANDLE                                     m_lastZipline;                                            // 0x2E7C(0x0004)
	struct Time                                        m_lastZiplineDetachTime;                                  // 0x2E80(0x0004)
	bool                                               m_ziplineValid3pWeaponLayerAnim;                          // 0x2E84(0x0001)
	int                                                m_ziplineState;                                           // 0x2E88(0x0004)
	struct Embedded                                    m_zipline;                                                // 0x2E90(0x0000)
	struct Vector                                      m_ziplineViewOffsetPosition;                              // 0x2F08(0x000C)
	struct Vector                                      m_ziplineViewOffsetVelocity;                              // 0x2F14(0x000C)
	struct EHANDLE                                     m_ziplineGrenadeEntity;                                   // 0x2F20(0x0004)
	struct EHANDLE                                     m_ziplineGrenadeBeginStationEntity;                       // 0x2F24(0x0004)
	char                                               m_ziplineGrenadeBeginStationAttachmentId;                 // 0x2F28(0x0001)
	float                                              m_ziplineReattachCooldownTime;                            // 0x2F30(0x0004)
	char                                               m_ziplineCooldownIndex;                                   // 0x2F34(0x0001)
	int                                                m_playAnimationType;                                      // 0x2F38(0x0004)
	bool                                               m_detachGrappleOnPlayAnimationEnd;                        // 0x2F3C(0x0001)
	int                                                m_playAnimationNext;                                      // 0x2F3E(0x0004)
	bool                                               m_boosting;                                               // 0x2F50(0x0001)
	bool                                               m_activateBoost;                                          // 0x2F51(0x0001)
	bool                                               m_repeatedBoost;                                          // 0x2F52(0x0001)
	float                                              m_boostMeter;                                             // 0x2F54(0x0004)
	bool                                               m_jetpack;                                                // 0x2F58(0x0001)
	bool                                               m_activateJetpack;                                        // 0x2F59(0x0001)
	bool                                               m_jetpackAfterburner;                                     // 0x2F5A(0x0001)
	bool                                               m_gliding;                                                // 0x2F5B(0x0001)
	float                                              m_glideMeter;                                             // 0x2F5C(0x0004)
	float                                              m_glideRechargeDelayAccumulator;                          // 0x2F60(0x0004)
	bool                                               m_hovering;                                               // 0x2F64(0x0001)
	bool                                               m_isPerformingBoostAction;                                // 0x2F65(0x0001)
	float                                              m_lastJumpHeight;                                         // 0x2F68(0x0004)
	struct EHANDLE                                     m_touchingUpdraftTriggers;                                // 0x2F6C(0x0040)
	int                                                m_touchingUpdraftTriggersCount;                           // 0x2FAC(0x0004)
	struct EHANDLE                                     m_touchingSlipTriggers;                                   // 0x2FB0(0x0040)
	int                                                m_touchingSlipTriggersCount;                              // 0x2FF0(0x0004)
	struct Vector                                      m_slipAirRestrictDirection;                               // 0x2FF4(0x000C)
	struct Time                                        m_slipAirRestrictTime;                                    // 0x3000(0x0004)
	struct Embedded                                    m_melee;                                                  // 0x3198(0x0000)
	bool                                               m_useCredit;                                              // 0x31D0(0x0001)
	struct Time                                        m_wallRunStartTime;                                       // 0x3574(0x0004)
	struct Time                                        m_wallRunClearTime;                                       // 0x3578(0x0004)
	float                                              m_onSlopeTime;                                            // 0x357C(0x0004)
	struct Vector                                      m_lastWallNormal;                                         // 0x3580(0x000C)
	bool                                               m_dodging;                                                // 0x358C(0x0001)
	struct Time                                        m_lastDodgeTime;                                          // 0x3590(0x0004)
	struct Vector                                      m_vecPreviouslyPredictedOrigin;                           // 0x35A8(0x000C)
	float                                              m_flTimeLastTouchedWall;                                  // 0x35B4(0x0004)
	struct Time                                        m_timeJetpackHeightActivateCheckPassed;                   // 0x35B8(0x0004)
	float                                              m_flTimeLastTouchedGround;                                // 0x35BC(0x0004)
	float                                              m_flTimeLastJumped;                                       // 0x35C0(0x0004)
	float                                              m_flTimeLastJumpGraceTap;                                 // 0x35C4(0x0004)
	float                                              m_flJumpGraceMultiTapFactor;                              // 0x35C8(0x0004)
	int                                                m_jumpGraceTapCount;                                      // 0x35CC(0x0004)
	float                                              m_flTimeLastLanded;                                       // 0x35D0(0x0004)
	float                                              m_flLastLandFromHeight;                                   // 0x35D4(0x0004)
	float                                              m_usePressedTime;                                         // 0x35D8(0x0004)
	float                                              m_lastUseTime;                                            // 0x35DC(0x0004)
	struct Vector                                      m_lastFakeFloorPos;                                       // 0x35EC(0x000C)
	bool                                               m_bHasJumpedSinceTouchedGround;                           // 0x35F8(0x0001)
	bool                                               m_bDoMultiJumpPenalty;                                    // 0x35F9(0x0001)
	bool                                               m_dodgingInAir;                                           // 0x35FA(0x0001)
	float                                              m_timeShouldTryGivePlayerDoubleJump;                      // 0x3638(0x0004)
	bool                                               m_activeViewmodelModifiers;                               // 0x3830(0x0035)
	struct Time                                        m_lastMoveInputTime;                                      // 0x3AC8(0x0004)
	struct EHANDLE                                     m_ignoreEntityForMovementUntilNotTouching;                // 0x3ACC(0x0004)
	float                                              m_gameMovementUtil.m_surfaceFriction;                     // 0x3F98(0x0004)
	struct EHANDLE                                     m_lungeTargetEntity;                                      // 0x4014(0x0004)
	bool                                               m_isLungingToPosition;                                    // 0x4018(0x0001)
	struct Vector                                      m_lungeTargetPosition;                                    // 0x401C(0x000C)
	struct Vector                                      m_lungeStartPositionOffset;                               // 0x4028(0x000C)
	struct Vector                                      m_lungeEndPositionOffset;                                 // 0x4034(0x000C)
	struct Time                                        m_lungeStartTime;                                         // 0x4040(0x0004)
	struct Time                                        m_lungeEndTime;                                           // 0x4044(0x0004)
	bool                                               m_lungeCanFly;                                            // 0x4048(0x0001)
	bool                                               m_lungeLockPitch;                                         // 0x4049(0x0001)
	float                                              m_lungeStartPitch;                                        // 0x404C(0x0004)
	float                                              m_lungeSmoothTime;                                        // 0x4050(0x0004)
	float                                              m_lungeMaxTime;                                           // 0x4054(0x0004)
	float                                              m_lungeMaxEndSpeed;                                       // 0x4058(0x0004)
	struct Vector                                      m_vPrevGroundNormal;                                      // 0x4314(0x000C)
	struct EHANDLE                                     m_prepClimbPusher;                                        // 0x45E4(0x0004)
	struct Vector                                      m_pushAwayFromTopAcceleration;                            // 0x45E8(0x000C)
	bool                                               m_controllerModeActive;                                   // 0x4614(0x0001)
	float                                              m_skydiveForwardPoseValueVelocity;                        // 0x462C(0x0004)
	float                                              m_skydiveForwardPoseValueTarget;                          // 0x4630(0x0004)
	float                                              m_skydiveForwardPoseValueCurrent;                         // 0x4634(0x0004)
	float                                              m_skydiveSidePoseValueVelocity;                           // 0x4638(0x0004)
	float                                              m_skydiveSidePoseValueTarget;                             // 0x463C(0x0004)
	float                                              m_skydiveSidePoseValueCurrent;                            // 0x4640(0x0004)
	float                                              m_skydiveYawVelocity;                                     // 0x4644(0x0004)
	bool                                               m_skydiveIsNearLeviathan;                                 // 0x4648(0x0001)
	int                                                m_skydiveState;                                           // 0x4664(0x0004)
	struct Time                                        m_skydiveStartTime;                                       // 0x4668(0x0004)
	struct Time                                        m_skydiveEndTime;                                         // 0x466C(0x0004)
	struct Time                                        m_skydiveAnticipateStartTime;                             // 0x4670(0x0004)
	struct Time                                        m_skydiveAnticipateEndTime;                               // 0x4674(0x0004)
	float                                              m_skydiveDistanceToLand;                                  // 0x4678(0x0004)
	float                                              m_skydiveDiveAngle;                                       // 0x467C(0x0004)
	bool                                               m_skydiveIsDiving;                                        // 0x4680(0x0001)
	float                                              m_skydiveSpeed;                                           // 0x4684(0x0004)
	float                                              m_skydiveStrafeAngle;                                     // 0x4688(0x0004)
	bool                                               m_skydiveFreelookEnabled;                                 // 0x468C(0x0001)
	struct Vector                                      m_skydiveFreelookLockedAngle;                             // 0x4690(0x000C)
	float                                              m_skydivePlayerPitch;                                     // 0x469C(0x0004)
	float                                              m_skydivePlayerYaw;                                       // 0x46A0(0x0004)
	bool                                               m_skydiveFollowing;                                       // 0x46A4(0x0001)
	struct Vector                                      m_skydiveUnfollowVelocity;                                // 0x46A8(0x000C)
	struct Vector                                      m_skydiveLeviathanHitPosition;                            // 0x46B8(0x000C)
	struct Vector                                      m_skydiveLeviathanHitNormal;                              // 0x46C4(0x000C)
	struct Vector                                      m_skydiveSlipVelocity;                                    // 0x46D0(0x000C)
	bool                                               m_skydiveFromUpdraft;                                     // 0x46DC(0x0001)
	bool                                               m_skydiveFromSkywardLaunch;                               // 0x46DD(0x0001)
	int                                                m_skywardLaunchState;                                     // 0x46E0(0x0004)
	struct Vector                                      m_skywardDeployStartPos;                                  // 0x46E8(0x000C)
	float                                              m_skywardLaunchSlowStartTime;                             // 0x46F4(0x0004)
	float                                              m_skywardLaunchSlowEndTime;                               // 0x46F8(0x0004)
	float                                              m_skywardLaunchFastEndTime;                               // 0x46FC(0x0004)
	float                                              m_skywardDeployEndTime;                                   // 0x4700(0x0004)
	float                                              m_skywardLaunchEndTime;                                   // 0x4704(0x0004)
	float                                              m_skywardDeploySpeed;                                     // 0x4708(0x0004)
	float                                              m_skywardLaunchSlowSpeed;                                 // 0x470C(0x0004)
	float                                              m_skywardLaunchFastSpeed;                                 // 0x4710(0x0004)
	struct Vector                                      m_skywardOffset;                                          // 0x4714(0x000C)
	float                                              m_skywardOffsetSpeed;                                     // 0x4720(0x0004)
	bool                                               m_skywardLaunchInterrupted;                               // 0x4724(0x0001)
	bool                                               m_skywardLaunchFollowing;                                 // 0x4725(0x0001)
	struct Vector                                      m_armoredLeapAirPos;                                      // 0x472C(0x000C)
	struct Vector                                      m_armoredLeapEndPos;                                      // 0x4738(0x000C)
	int                                                m_armoredLeapType;                                        // 0x4744(0x0004)
	int                                                m_armoredLeapPhase;                                       // 0x4748(0x0004)
	struct Time                                        m_armoredLeapStartTime;                                   // 0x474C(0x0004)
	int                                                m_dragReviveState;                                        // 0x47B8(0x0004)
	float                                              m_dragReviveOutroStartTime;                               // 0x47BC(0x0004)
	struct EHANDLE                                     m_reviveTarget;                                           // 0x47C0(0x0004)
	struct Embedded                                    m_playerKnockBacks;                                       // 0x47F0(0x0000)
	int                                                m_updraftCount;                                           // 0x4870(0x0004)
	int                                                m_updraftStage;                                           // 0x4874(0x0004)
	struct Time                                        m_updraftEnterTime;                                       // 0x4878(0x0004)
	struct Time                                        m_updraftLeaveTime;                                       // 0x487C(0x0004)
	float                                              m_updraftMinShakeActivationHeight;                        // 0x4880(0x0004)
	float                                              m_updraftMaxShakeActivationHeight;                        // 0x4884(0x0004)
	float                                              m_updraftLiftActivationHeight;                            // 0x4888(0x0004)
	float                                              m_updraftLiftSpeed;                                       // 0x488C(0x0004)
	float                                              m_updraftLiftAcceleration;                                // 0x4890(0x0004)
	float                                              m_updraftLiftExitDuration;                                // 0x4894(0x0004)
	struct Time                                        m_updraftSlowTime;                                        // 0x4898(0x0004)
};

//class DataMap.C_WindEmitter
class C_WindEmitter
{
	struct Vector                                      m_params.shapeParams;                                     // 0x0A60(0x000C)
	struct Vector                                      m_params.windDir;                                         // 0x0A6C(0x000C)
	float                                              m_params.windSpeed;                                       // 0x0A78(0x0004)
	int                                                m_params.shapeType;                                       // 0x0A7C(0x0004)
	bool                                               m_params.enabled;                                         // 0x0A80(0x0001)
};

//class DataMap.C_WindVolume
class C_WindVolume
{
	struct Vector                                      m_params.shapeParams;                                     // 0x0A60(0x000C)
	struct Vector                                      m_params.scale;                                           // 0x0A6C(0x000C)
	struct Vector                                      m_params.windOrigin;                                      // 0x0A78(0x000C)
	struct Vector                                      m_params.windDir;                                         // 0x0A84(0x000C)
	float                                              m_params.windSpeed;                                       // 0x0A90(0x0004)
	int                                                m_params.windType;                                        // 0x0A94(0x0004)
	float                                              m_params.windGustScale;                                   // 0x0A98(0x0004)
	float                                              m_params.edgeFade;                                        // 0x0A9C(0x0004)
	int                                                m_params.shapeType;                                       // 0x0AA0(0x0004)
	int                                                m_params.sortPriority;                                    // 0x0AA4(0x0004)
	bool                                               m_params.enabled;                                         // 0x0AA8(0x0001)
};

//class DataMap.C_WindSettings
class C_WindSettings
{
	string                                             m_windGustTexture;                                        // 0x0A60(0x0008)
};

//class DataMap.C_BaseAnimatingOverlay
class C_BaseAnimatingOverlay
{
	struct Embedded                                    m_AnimOverlay;                                            // 0x1648(0x0000)
	int                                                m_AnimOverlayCount;                                       // 0x1720(0x0004)
	bool                                               m_currentFrameAnimatingOverlay.animOverlayIsActive;       // 0x1774(0x0009)
	float                                              m_currentFrameAnimatingOverlay.animOverlayStartTime;      // 0x1780(0x0024)
	float                                              m_currentFrameAnimatingOverlay.animOverlayStartCycle;     // 0x17A4(0x0024)
	float                                              m_currentFrameAnimatingOverlay.animOverlayPlaybackRate;   // 0x17C8(0x0024)
	int                                                m_currentFrameAnimatingOverlay.animOverlayModelIndex;     // 0x17EC(0x0024)
	int                                                m_currentFrameAnimatingOverlay.animOverlaySequence;       // 0x1810(0x0012)
	float                                              m_currentFrameAnimatingOverlay.animOverlayWeight;         // 0x1824(0x0024)
	int                                                m_currentFrameAnimatingOverlay.animOverlayOrder;          // 0x1848(0x0024)
	float                                              m_currentFrameAnimatingOverlay.animOverlayAnimTime;       // 0x186C(0x0024)
	float                                              m_currentFrameAnimatingOverlay.animOverlayFadeInDuration; // 0x1890(0x0024)
	float                                              m_currentFrameAnimatingOverlay.animOverlayFadeOutDuration;// 0x18B4(0x0024)
	float                                              m_currentFrameAnimatingOverlay.animOverlayCycle;          // 0x18D8(0x0024)
};

//class DataMap.C_BaseCombatCharacter
class C_BaseCombatCharacter
{
	struct EHANDLE                                     m_currentFrame.weaponGettingSwitchedOut;                  // 0x00C8(0x0008)
	bool                                               m_currentFrame.showActiveWeapon3p;                        // 0x00D0(0x0002)
	float                                              m_deathVelocity;                                          // 0x0474(0x000C)
	int                                                m_phaseShiftFlags;                                        // 0x07B8(0x0004)
	struct Time                                        m_flNextAttack;                                           // 0x1980(0x0004)
	struct Time                                        m_lastFiredTime;                                          // 0x1984(0x0004)
	struct EHANDLE                                     m_lastFiredWeapon;                                        // 0x1988(0x0004)
	struct Time                                        m_raiseFromMeleeEndTime;                                  // 0x198C(0x0004)
	int                                                m_sharedEnergyCount;                                      // 0x1990(0x0004)
	int                                                m_sharedEnergyTotal;                                      // 0x1994(0x0004)
	int                                                m_sharedEnergyLockoutThreshold;                           // 0x1998(0x0004)
	struct Time                                        m_lastSharedEnergyRegenTime;                              // 0x199C(0x0004)
	struct Time                                        m_sharedEnergyRegenRate;                                  // 0x19A0(0x0004)
	float                                              m_sharedEnergyRegenDelay;                                 // 0x19A4(0x0004)
	struct Time                                        m_lastSharedEnergyTakeTime;                               // 0x19A8(0x0004)
	struct Embedded                                    m_inventory;                                              // 0x19B0(0x0000)
	char                                               m_selectedWeapons;                                        // 0x1A10(0x0002)
	struct EHANDLE                                     m_latestPrimaryWeapons;                                   // 0x1A14(0x0008)
	struct EHANDLE                                     m_latestPrimaryWeaponsIndexZeroOrOne;                     // 0x1A1C(0x0008)
	char                                               m_latestNonOffhandWeapons;                                // 0x1A24(0x0002)
	char                                               m_selectedOffhands;                                       // 0x1A26(0x0003)
	char                                               m_selectedOffhandsPendingHybridAction;                    // 0x1A29(0x0003)
	char                                               m_lastCycleSlot;                                          // 0x1A2C(0x0001)
	struct EHANDLE                                     m_latestMeleeWeapon;                                      // 0x1A30(0x0004)
	int                                                m_weaponPermission;                                       // 0x1A34(0x0004)
	struct Time                                        m_weaponDelayEnableTime;                                  // 0x1A38(0x0004)
	bool                                               m_weaponDisabledInScript;                                 // 0x1A3C(0x0001)
	char                                               m_weaponDisabledFlags;                                    // 0x1A52(0x0001)
	int                                                m_weaponTypeDisabledFlags;                                // 0x1A58(0x0004)
	char                                               m_weaponTypeDisabledRefCount;                             // 0x1A5C(0x0009)
	bool                                               m_weaponAmmoRegenDisabled;                                // 0x1A65(0x0001)
	int                                                m_weaponAmmoRegenDisabledRefCount;                        // 0x1A68(0x0004)
	bool                                               m_hudInfo_visibilityTestAlwaysPasses;                     // 0x1A6C(0x0001)
	int                                                m_contextAction;                                          // 0x1A80(0x0004)
	int                                                m_phaseShiftType;                                         // 0x1AAC(0x0004)
	struct Time                                        m_phaseShiftTimeStart;                                    // 0x1AB0(0x0004)
	struct Time                                        m_phaseShiftTimeEnd;                                      // 0x1AB4(0x0004)
};

//class DataMap.C_ExposureController
class C_ExposureController
{
	float                                              m_autoCompensation;                                       // 0x0A60(0x0004)
	float                                              m_autoForceValue;                                         // 0x0A64(0x0004)
	float                                              m_autoMin;                                                // 0x0A68(0x0004)
	float                                              m_autoMax;                                                // 0x0A6C(0x0004)
	float                                              m_autoSpeed;                                              // 0x0A70(0x0004)
	float                                              m_minFadeTime;                                            // 0x0A74(0x0004)
	bool                                               m_isDirectional;                                          // 0x0A78(0x0001)
	float                                              m_directionalHalfAngle;                                   // 0x0A7C(0x0004)
};

//class DataMap.C_ExposureVolume
class C_ExposureVolume
{
	struct unknow                                      m_volumeTester;                                           // 0x0A60(0x0008)
	struct ClassPtr                                    m_exposureTarget;                                         // 0x0A68(0x0008)
	string                                             m_exposureTargetName;                                     // 0x0A70(0x0008)
	float                                              m_exposurePriority;                                       // 0x0A78(0x0004)
};

//class DataMap.C_FogController
class C_FogController
{
	struct Embedded                                    m_fogParams;                                              // 0x0A60(0x006C)
	struct Vector                                      m_fogAngles;                                              // 0x0ACC(0x000C)
	bool                                               m_useAbsAngles;                                           // 0x0AD8(0x0001)
};

//class DataMap.C_FogVolume
class C_FogVolume
{
	struct unknow                                      m_volumeTester;                                           // 0x0A60(0x0008)
	struct ClassPtr                                    m_fogTarget;                                              // 0x0A68(0x0008)
	string                                             m_fogTargetName;                                          // 0x0A70(0x0008)
	int                                                m_fogPriority;                                            // 0x0A78(0x0004)
};

//class DataMap.C_BreakableSurface
class C_BreakableSurface
{
	char                                               m_nPanelBits;                                             // 0x0CE8(0x0100)
};

//class DataMap.C_NPC_SentryTurret
class C_NPC_SentryTurret
{
	int                                                m_killCount;                                              // 0x1DF4(0x0004)
	int                                                m_titanKillCount;                                         // 0x1DF8(0x0004)
};

//class DataMap.C_ParticleSystem
class C_ParticleSystem
{
	bool                                               m_bClientSide;                                            // 0x0A68(0x0001)
	bool                                               m_bActive;                                                // 0x0A69(0x0001)
	float                                              m_warmUpTime;                                             // 0x0A70(0x0004)
	bool                                               m_pauseAfterWarmup;                                       // 0x0A74(0x0001)
	bool                                               m_bInSkybox;                                              // 0x0A75(0x0001)
	bool                                               m_killForReplay;                                          // 0x0A76(0x0001)
	bool                                               m_killIfOverLimit;                                        // 0x0A77(0x0001)
};

//class DataMap.C_DynamicProp
class C_DynamicProp
{
	bool                                               m_bClientSide;                                            // 0x1640(0x0001)
};

//class DataMap.C_Team
class C_Team
{
	int                                                m_score;                                                  // 0x0A60(0x0004)
	int                                                m_score2;                                                 // 0x0A64(0x0004)
	int                                                m_kills;                                                  // 0x0A68(0x0004)
	int                                                m_deaths;                                                 // 0x0A6C(0x0004)
	int                                                m_iRoundsWon;                                             // 0x0A70(0x0004)
	int                                                m_iTeamTeamNum;                                           // 0x0A74(0x0004)
	char                                               m_szTeamname;                                             // 0x0A98(0x0100)
};

//class DataMap.C_PlayerVehicle
class C_PlayerVehicle
{
